// © Copyright 2013, 2015-2016 HP Development Company, L.P.

TaskName = "Konfiguracja komunikacji bezprzewodowej";
TaskTOCTitle = "Automatyczne łączenie bezprzewodowe HP";
ConfirmSettingsTaskName = "Potwierdź Automatyczne łączenie bezprzewodowe HP";
ConfirmSettingsTaskTOCTitle = "Potwierdź ustawienia sieci bezprzewodowej";
NetworkSelectTaskName = "Wybierz sieć";
DeviceDiscoveryTaskName = "Wybierz urządzenie";
DeviceDiscoveryTaskTitle = "Wybierz urządzenie do skonfigurowania";
ConfigureSettingsTaskName = "Konfigurowanie urządzenia";
ResultsTaskName = "Wyniki konfigurowania";

// confirmation pane
ConfirmationDescriptionText = "Jeśli użyjesz funkcji Automatyczne łączenie z siecią bezprzewodową, komputer na chwilę przerwie połączenie z siecią bezprzewodową — dlatego należy zaczekać na ukończenie wszystkich trwających transmisji plików. Przerwa potrwa prawdopodobnie około 30 sekund. Następnie połączenie bezprzewodowe zostanie przywrócone.";
HostNetworkDetectedTitle = "Aplikacja wykryła, że urządzenie jest aktualnie podłączone do sieci bezprzewodowej o następujących ustawieniach:";
WirelessNetworkNameTitle = "Nazwa sieci bezprzewodowej:";
CommunicationModeTitle = "Tryb komunikacji:";
EncryptionTypeTitle = "Typ szyfrowania:";

WirelessNetworkChooseTitle = "Czy chcesz skonfigurować w urządzeniu powyższe ustawienia?";
KeepCurrentNetworkSettingsTitle = "Tak, zachowaj te ustawienia.";
ChooseAnotherNetworkSettingsTitle = "Nie, chcę wybrać inną sieć.";
ShowSettingsTitle = "Pokaż ustawienia";

// network selection pane
NetworkSelectTitle = "Wybierz nazwę sieci bezprzewodowej z poniższej listy.";
SelectedNetworkPasswordTitle = "Hasło:";
NetworkSelectContinueDescription= "Kliknij przycisk Kontynuuj, aby dodać urządzenie do sieci „%@”.";
NetworkDiscoveryFailedTitle = "Wykrycie sieci nie udało się";
NetworkDiscoveryFailedDescription = "Nie wykryto żadnych sieci bezprzewodowych.";
SetupNetworkSelectedTitle = "Wybierz inną sieć";
SetupNetworkSelectedDescription = "Próbujesz połączyć się ze specjalną siecią, która została utworzona przez urządzenie drukujące. Kliknij przycisk OK i wybierz inną sieć.";

NetworkNotAvailableTitle = "Sieć niedostępna";
DeviceNetworkNotAvailableMessageFormat = "Urządzenie nie może uzyskać dostępu do sieci bezprzewodowej „%@”. Upewnij się, że punkt dostępu bezprzewodowego działa poprawnie i znajduje się w zasięgu urządzenia, lub wybierz inną sieć.";
MacNetworkNotAvailableMessageFormat = "Komputer Mac nie może uzyskać dostępu do sieci bezprzewodowej „%@”. Upewnij się, że punkt dostępu bezprzewodowego działa poprawnie i znajduje się w zasięgu komputera Mac, lub wybierz inną sieć.";
ChangeNetworkButtonTitle= "Zmień sieć";

LookingForNetworkMessageFormat = "Wyszukiwanie sieci: „%@”.";

UnsupportedNetworkTitle = "Nieobsługiwana sieć";
UnsupportedNetworkMessageFormat = "Wybierz inną sieć lub poproś o pomoc administratora sieci.";

EnterpriseNetworkAlertTitle = "Wybrano sieć Enterprise";
EnterpriseNetworkAlertForUSBConnectionMessage = "Ta sieć jest zabezpieczona przy użyciu szyfrowania typu enterprise. Podłącz drukarkę do tej samej sieci, do której podłączony jest komputer, a następnie użyj wbudowanego serwera WWW lub skontaktuj się z administratorem.";
EnterpriseNetworkAlertForNetworkConnectionMessage = "Ta sieć jest zabezpieczona przy użyciu szyfrowania typu enterprise. Aby podłączyć drukarkę do sieci, należy użyć wbudowanego serwera WWW (EWS) lub skontaktować się z administratorem. W przypadku wybrania serwera EWS komputer zostanie rozłączony z siecią bezprzewodową i połączy się ze specjalną siecią utworzoną przez drukarkę.";
ConfigureUsingEWSButtonTitle = "Konfiguruj przy użyciu serwera EWS";
ConnectingToDeviceProgressTitle = "Łączenie z siecią urządzenia...";

UnableToConnectToDeviceNetworkAlertMessage = "Upewnij się, że urządzenie znajduje się w zasięgu tego komputera i niebieski wskaźnik na urządzeniu miga, wskazując, że działa ono w trybie HP Auto Wireless Control. Tryb ten można zresetować przy użyciu opcji Przywróć domyślne ustawienia sieciowe na panelu sterowania urządzenia. Metoda ta jest opisana w dokumentacji urządzenia.";

// select device
DeviceNameColumnTitle = "Nazwa urządzenia";
DeviceModelColumnTitle = "Model urządzenia";
AllFilterTitle = "Wszystkie";
DevicesFilterLabel = "Urządzenia:";
SupportedDevicesFilterTitle = "Obsługiwane";

// configure
ConfigureTaskName = "Konfigurowanie urządzenia HP";
ConfigureTitle = "Konfigurowanie…";
NoteTitle = "Twoje urządzenie HP jest konfigurowane w celu podłączenia do wybranej sieci bezprzewodowej. Może to potrwać kilka minut.";
RestoringNetworkSettings = "Przywracanie ustawień sieciowych...";

// particular errors
IncorrectPasswordTitle = "Hasło odrzucone";
IncorrectPasswordDescription = "Hasło zostało odrzucone przez sieć bezprzewodową „%@”.\n\nPodaj hasło jeszcze raz";

DuplicateNetworkNameErrorTitle = "Zduplikowane nazwy sieci WiFi";
DuplicateNetworkNameErrorDescription = "Wykryto zduplikowane sieci WiFi „%@”. Sprawdź ustawienia routera bezprzewodowego.";

MacAddressFilterErrorTitle = "Błąd filtru WiFi";
MacAddressFilterErrorDescription = "Adres sprzętowy MAC urządzenia został odfiltrowany i jest niedostępny w sieci „%@”. Sprawdź ustawienia routera bezprzewodowego.";

WeakSignalStrengthErrorTitle = "Słaba siła sygnału";
WeakSignalStrengthErrorDescription = "Siła sygnału routera bezprzewodowego „%@” jest słaba. Przesuń urządzenie bliżej routera.";

DeviceNotReachableErrorTitle = "Urządzenie jest nieosiągalne";
DeviceNotReachableErrorDescription = "Ustawienia sieci bezprzewodowej zostały pomyślnie pobrane na urządzenie. Jednakże komputer Macintosh nie mógł znaleźć urządzenia w sieci.\n\nUpewnij się, że:\n• Komputer Macintosh jest podłączony do sieci przewodowej lub bezprzewodowej mającej dostęp do danego urządzenia.\n• Urządzenie jest podłączone do sieci bezprzewodowej „%@”.";

EmptyPasswordError = "Hasło jest wymagane.";
TooShortWPAPersonalPasswordError = "Hasło musi mieć co najmniej 8 znaków.";
TooLongWPAPersonalPasswordError = "Hasło nie może być dłuższe niż 64 znaki.";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "Nie można przywrócić połączenia z oryginalną siecią bezprzewodową";

NoPasswordIsStoredInKeychainErrorMessageFormat = "Asystent nie był w stanie odczytać poświadczeń dla sieci bezprzewodowej „%@” z systemu Keychain. Upewnij się, że komputer Macintosh jest podłączony do przewodowej lub bezprzewodowej sieci mającej dostęp do urządzenia.";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "Poświadczenia nie zostały zaakceptowane przez sieć bezprzewodową „%@”. Upewnij się, że komputer Macintosh jest podłączony do przewodowej lub bezprzewodowej sieci mającej dostęp do urządzenia.";
FailedToRestoreOriginalNetworkGenericErrorMessage = "Upewnij się, że punkt dostępu bezprzewodowego działa poprawnie i jest w zasięgu komputera Macintosh, a następnie spróbuj ręcznie nawiązać połączenie.";

// results
ManualNetworkConfigurationTitle = "Ręcznie";
AutoNetworkConfigurationTitle = "Automatycznie";
LinklocalNetworkConfigurationTitle = "Adres link-local";
NetworkSettingsTitle = "Ustawienia sieci";
ConfigurationFailedTaskName = "Konfiguracja nie udała się";
ConfigurationCompleteTaskName = "Konfiguracja ukończona";
ConfigurationFailedTitle = "Asystent nie był w stanie skonfigurować urządzenia przy użyciu połączenia bezprzewodowego.";
ConfigurationSucceededTitle = "Urządzenie HP zostało skonfigurowane poprawnie i podłączone do sieci „%@”.";
ConfigurationOverUSBFailedTitle = "Asystent nie był w stanie skonfigurować urządzenia przy użyciu połączenia USB.";
ConfigurationOverUSBFailedNote = "Upewnij się, że punkt dostępu bezprzewodowego działa poprawnie, urządzenie znajduje się w jego zasięgu, jest włączone i w stanie gotowości, a następnie kliknij opcję Ponów, aby spróbować ponownie.";

ConfigurationFailedNote = "Upewnij się, że punkt dostępu bezprzewodowego działa poprawnie i urządzenie znajduje się w jego zasięgu, jest włączone i w stanie gotowości, a następnie kliknij opcję Ponów, aby spróbować ponownie.\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "Upewnij się, że urządzenie jest włączone i znajduje się w zasięgu tego komputera, a następnie kliknij opcję Ponów, aby spróbować ponownie. Migający niebieski wskaźnik na urządzeniu będzie wskazywać, że urządzenie jest w trybie Automatyczne łączenie bezprzewodowe HP. Po pierwszym włączeniu urządzenia w trakcie instalacji pozostanie w tym trybie przez maksymalnie godzinę do momentu połączenia się z siecią.\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "Upewnij się, że Twoje urządzenie znajduje się w polu widzenia komputera, i że urządzenie jest w trybie HP Auto Wireless Connect. Następnie kliknij przycisk Ponów, aby ponowić próbę. Można zresetować tryb HP Auto Wireless Connect, używając opcji Przywróć domyślne ustawienia sieci na panelu sterowania urządzenia. Odpowiednie instrukcje można znaleźć w dokumentacji urządzenia.\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "Upewnij się, że urządzenie znajduje się w zasięgu tego komputera i niebieski wskaźnik na urządzeniu miga, wskazując, że działa ono w trybie Automatyczne łączenie bezprzewodowe HP. Następnie kliknij opcję Ponów, aby spróbować ponownie. Tryb Automatyczne łączenie bezprzewodowe HP można zresetować przy użyciu opcji Przywróć domyślne ustawienia sieciowe na panelu sterowania urządzenia. Metoda ta jest opisana w dokumentacji urządzenia.\n\n%@";
ConfigurationFailedUSBSOWPart = "Możesz też skonfigurować urządzenie, podłączając je do komputera przy użyciu kabla USB i klikając opcję Ponów. Po skonfigurowaniu urządzenia do przyłączenia do wybranej wcześniej sieci można odłączyć kabel od komputera.";
ConfigurationFailedFPSOWPart = "Możesz też skonfigurować urządzenie do połączenia z siecią bezprzewodową przy użyciu Kreatora konfiguracji sieci bezprzewodowej dostępnego z panelu sterowania urządzenia. W tym celu wykonaj następujące czynności:
       1. Naciśnij przycisk lub dotknij ikony Bezprzewodowe na urządzeniu.
       2. Na wyświetlaczu urządzenia otwórz ekran stanu sieci bezprzewodowej i wybierz Ustawienia
       3. Wybierz Kreatora konfiguracji sieci bezprzewodowej i postępuj zgodnie z instrukcjami wyświetlanymi na ekranie.


Po pomyślnym zakończeniu pracy kreatora urządzenie automatycznie połączy się z siecią.";

MoreInfoText = "Aby uzyskać więcej informacji, wejdź na stronę internetową";
FailedTitle = "Nie udało się odczytać danych sieci";
BonjourServiceNameLabel = "Nazwa usługi Bonjour:";
IPAddress = "Adres IP:";
AddressMode = "Tryb adresu:";
SubnetMask = "Maska podsieci:";
DefaultGateway = "Brama domyślna:";
HostName = "Nazwa hosta:";
PrefixLength = "Długość prefiksu:";
DisconnectUSBWarningText = "<b>Ważne:</b> Odłącz teraz kabel USB podłączony do urządzenia.";
DeviceNotLocatedWarningText = "Ustawienia sieci bezprzewodowej zostały pomyślnie pobrane na urządzenie. Jednak system Mac nie był w stanie znaleźć urządzenia w sieci.";

// network settings
Adhoc = "Adhoc";
Infrastructure = "Infrastruktura";

// select network
NetworkColumnTitle = "Sieć";
SignalStrengthColumnTitle = "Siła sygnału";
EncryptionColumnTitle = "Szyfrowanie";
ModeColumnTitle = "Tryb";
